# 2) კომენტარების სახით თქვენი სიტყვებით ახსენით ყველა მონაცემთა ტიპი (string, integer, float)

# string ტიპი არის ბრჭყალებში მოცემული სიმბოლოები. მაგალითად: "Hello, World!"
# integer ტიპი არის მთელი რიცხვი. მაგალითად: 5, -10, 0
# float ტიპი არის  დამრგვალებული რიცხვი. მაგალითად: 3.14, -2.5, 0.0

# 3) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ მათ.

# ცვლადი არის მონაცემთა შენახვის ადგილი სადაც ვინახავთ სხვადასხვა ტიპის მნიშვნელობებს. 

# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშვნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.

from os import name


print("dachi")
print("luka")
print("mari")
print("nino")
print("saba")

print(5 )
print(10)
print(15)
print(20)
print(25)

print(3.14)
print(2.71)
print(1.41)
print(0.57)
print(0.0)

# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ ერთი დიდი წინადადება ერთი print() ფუნქციის მეშვეობით.

name1 = "100"
name2 = "2003"
name3 = "30067"
name4 = "400345"
name5 = "500264"

print(name1, name2, name3, name4, name5)

# 6) გააკეთეთ 3-3 მაგალითი ყველა მათემატიკურ ოპერაციებზე.

print(15 + 465)
print(1234 + 3556)
print(1324 + 90876)

print(2456 - 134)
print(9876 - 5432)
print(10000 - 9999)

print(15 * 465)
print(1234 * 3556)
print(1324 * 90876)

print(2456 / 134)
print(9876 / 5432)
print(10000 / 9569)

print(400 // 8)
print(1000 // 3)
print(100 // 7)

# 7) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი termian-ში.

num_1 = 378
num_2 = 7896
num_3 = 567

print(num_1 + num_2 + num_3)
